[
    {
        "version": "1.0.0",
        "date": "2024-07-25",
        "notes": [
            "Initial release of the Spectre Divide Points Calculator.",
            "Supports multiple currencies.",
            "Added feedback functionality."
        ]
    },
    {
        "version": "1.1.0",
        "date": "2024-09-05",
        "notes": [
            "Added support for multiple new currencies including AED, BRL, INR, JPY, and more.",
            "Improved VP calculation logic for more accurate cost estimation across regions.",
            "Enhanced UI with animations when displaying total costs.",
            "Updated the feedback button to show tooltip indicating it's disabled.",
            "Fixed bugs related to the display of items in the list after reset.",
            "Introduced new notification system for user alerts and promotions."
        ]
    },
    {
        "version": "1.2.0",
        "date": "2024-09-07",
        "notes": [
            "Removed unnecessary SP Cost display element from the UI.",
            "Updated total cost display to include bonus SP values in a more prominent and styled format.",
            "Bonus SP values are now highlighted in yellow for better visibility."
        ]
    },
    {
        "version": "1.3.0",
        "date": "2024-09-19",
        "notes": [
            "Introduced a new in-game shop list page.",
            "Users can now access and view available shop items and bundles directly through the calculator.",
            "Added the ability to link to external websites for more detailed in-game shop listings."
        ]
    },
    {
        "version": "1.4.0",
        "date": "2024-10-02",
        "notes": [
            "Fixed bug causing 'vpPackagesDiv is null' error by ensuring the VP packages container is present in the HTML.",
            "Improved VP package calculation to handle all edge cases and properly display total VP and bonus SP.",
            "Enhanced the VP package display section to ensure packages are listed with proper cost formatting.",
            "Added animations to the total cost display to highlight changes when new items are added."
        ]
    }
]
